## 2.2. Problem Statement: Pandas

In [1]:
import pandas as pd

#### Problem Statement 1:
1) How-to-count-distance-to-the-previous-zero
For each value, count the difference of the distance from the previous zero (or the start of
the Series, whichever is closer) and if there are no previous zeros, print the position
Consider a DataFrame df where there is an integer column {'X'[7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}
The values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.
import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [2]:
#Create Dictionary
dic = {'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}

#Create data frame
df = pd.DataFrame(dic)

#dictionary to hold distance previous zero values
distPreviousValues = {'Y':[]}

index = -1
for i in range(len(df.X)):
    if(df.X[i] == 0):
        index = i
        
    if(index == -1):
        distPreviousValues['Y'].append(i+1)
    else:
        distPreviousValues['Y'].append(i - index)

seri = pd.Series(distPreviousValues['Y'],name="Y")
df.join(seri)

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

2). Create a DatetimeIndex that contains each business day of 2015 and use it to index a
Series of random numbers.

In [3]:
import numpy as np
from numpy import random as rm
dateRange = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dateRange)), index=dateRange)
s

2015-01-01    0.516633
2015-01-02    0.417701
2015-01-05    0.832316
2015-01-06    0.966091
2015-01-07    0.448252
2015-01-08    0.274186
2015-01-09    0.858958
2015-01-12    0.171841
2015-01-13    0.176799
2015-01-14    0.610688
2015-01-15    0.311817
2015-01-16    0.833500
2015-01-19    0.671844
2015-01-20    0.037285
2015-01-21    0.237513
2015-01-22    0.435872
2015-01-23    0.602698
2015-01-26    0.041484
2015-01-27    0.423155
2015-01-28    0.299957
2015-01-29    0.737031
2015-01-30    0.971968
2015-02-02    0.926472
2015-02-03    0.645314
2015-02-04    0.439180
2015-02-05    0.601038
2015-02-06    0.299236
2015-02-09    0.288965
2015-02-10    0.699693
2015-02-11    0.818504
                ...
2015-11-20    0.262745
2015-11-23    0.832821
2015-11-24    0.279447
2015-11-25    0.988170
2015-11-26    0.469912
2015-11-27    0.482900
2015-11-30    0.214337
2015-12-01    0.821684
2015-12-02    0.658514
2015-12-03    0.447711
2015-12-04    0.988300
2015-12-07    0.236203
2015-12-08    0.644509
2015-12-09    0.908236
2015-12-10    0.162209
2015-12-11    0.144876
2015-12-14    0.240444
2015-12-15    0.510791
2015-12-16    0.379518
2015-12-17    0.669948
2015-12-18    0.541270
2015-12-21    0.154774
2015-12-22    0.921517
2015-12-23    0.808424
2015-12-24    0.120246
2015-12-25    0.369260
2015-12-28    0.409914
2015-12-29    0.740442
2015-12-30    0.217237
2015-12-31    0.753273
Freq: B, Length: 261, dtype: float64

3) Find the sum of the values in s for every Wednesday

In [4]:
from datetime import datetime

s[dateRange.weekday == 2].sum()

29.023478683657896

4) Average For each calendar month

In [5]:
s.resample('M').mean()

2015-01-31    0.494436
2015-02-28    0.593576
2015-03-31    0.572131
2015-04-30    0.513981
2015-05-31    0.522678
2015-06-30    0.513103
2015-07-31    0.465295
2015-08-31    0.512551
2015-09-30    0.454060
2015-10-31    0.432612
2015-11-30    0.458385
2015-12-31    0.515187
Freq: M, dtype: float64

5) For each group of four consecutive calendar months in s, find the date on which the highest
value occurred.

In [18]:
print(s.groupby(pd.Grouper(freq='4M')).idxmax())
print('\n')
print(s.groupby(pd.Grouper(freq='4M')).max())

2015-01-31   2015-01-30
2015-05-31   2015-02-13
2015-09-30   2015-08-24
2016-01-31   2015-12-04
dtype: datetime64[ns]


2015-01-31    0.971968
2015-05-31    0.998510
2015-09-30    0.996311
2016-01-31    0.988300
dtype: float64

#### Problem Statement 2:

Read the dataset from the below link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Nam
es_right.csv

In [7]:
dfbabyName = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
dfbabyName.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

1) Delete unnamed columns

In [8]:
dfbabyName.drop('Unnamed: 0',1,inplace= True)
dfbabyName.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

2)Show the distribution of male and female

In [9]:
groupbyGender = dfbabyName.groupby('Gender').sum().pipe(lambda group:group.Count/group.Count.sum()*100)
groupbyGender

Gender
F    46.243939
M    53.756061
Name: Count, dtype: float64

3)Show the top 5 most preferred names

In [10]:
mostpref = dfbabyName.groupby(['Name'])['Count'].sum()
df =mostpref.to_frame()
df.sort_values('Count',ascending=False).head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

4)What is the median name occurrence in the dataset

In [14]:
dfbabyName.loc[dfbabyName['Count'].median()]

Id            11361
Name      Elizabeth
Year           2004
Gender            F
State            AK
Count            27
Name: 11, dtype: object

5) Distribution of male and female born count by states

In [12]:
#dfbabyName.groupby(['Gender','State']).sum()
df = dfbabyName.groupby(['Gender','State']).sum()
df.pipe(lambda group:group.Count/group.Count.sum()*100)

Gender  State
F       AK       0.074108
        AL       0.607846
        AR       0.366196
        AZ       1.040518
        CA       6.815249
        CO       0.736290
        CT       0.399052
        DC       0.099589
        DE       0.088398
        FL       2.584369
        GA       1.551705
        HI       0.105244
        IA       0.408690
        ID       0.205548
        IL       1.962966
        IN       0.973878
        KS       0.415612
        KY       0.593428
        LA       0.626340
        MA       0.830671
        MD       0.762009
        ME       0.123422
        MI       1.357904
        MN       0.781684
        MO       0.869099
        MS       0.359508
        MT       0.089273
        NC       1.414822
        ND       0.084847
        NE       0.251254
                   ...
M       ME       0.157108
        MI       1.572746
        MN       0.900349
        MO       1.030233
        MS       0.453962
        MT       0.124622
        NC       1.630448
        ND       0.111534
        NE       0.317234
        NH       0.159457
        NJ       1.377412
        NM       0.320546
        NV       0.440515
        NY       3.309135
        OH       1.943292
        OK       0.645408
        OR       0.591294
        PA       1.927386
        RI       0.135339
        SC       0.670333
        SD       0.128292
        TN       1.125348
        TX       5.661518
        UT       0.692585
        VA       1.318050
        VT       0.060283
        WA       1.116207
        WI       0.880138
        WV       0.264125
        WY       0.061861
Name: Count, Length: 102, dtype: float64